# NOTE: hashicorp tap removed — terraform is managed by mise, not brew.

# ─── Shell & terminal ─────────────────────────────────────────────────────────
brew "fish"
brew "starship"
brew "zoxide"

# ─── Multiplexer & sessions ───────────────────────────────────────────────────
brew "tmux"
brew "sesh"

# ─── GitHub ──────────────────────────────────────────────────────────────────
brew "gh"

# ─── Fuzzy finder & UI helpers ────────────────────────────────────────────────
brew "fzf"
brew "gum"

# ─── Editor ──────────────────────────────────────────────────────────────────
brew "neovim"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "git-delta"

# ─── Version manager ─────────────────────────────────────────────────────────
brew "mise"

# ─── Infrastructure ──────────────────────────────────────────────────────────
# NOTE: terraform is managed by mise (see dotfiles/mise/config.toml), not brew.
# brew "hashicorp/tap/terraform"

# ─── Fonts ───────────────────────────────────────────────────────────────────
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"

# ─── Apps ────────────────────────────────────────────────────────────────────
cask "ghostty"
